let bio = "জীববিজ্ঞান";
let p = "পদার্থবিজ্ঞান";
let b = "বাংলা";
let c = "রসায়ন";
let m = "উচ্চতর গণিত";
let e = "ইংরেজি";
let i = "ICT";
//let subject; //chilo ekhane kono karone ( kintu keno seta mone nai)

let days = ["রবিবার", "সোমবার", "মঙ্গলবার", "বুধবার","বৃহস্পতিবার", "শুক্রবার", "শনিবার"];


let routine = [
  {
    // Sunday (রবিবার)
    "550": "জীববিজ্ঞান", "590": "পদার্থবিজ্ঞান", "630": "বাংলা", "670": "রসায়ন", "710": "উচ্চতর গণিত", "750": "ইংরেজি", "790": "ICT"
  },
  {
    // Monday (সোমবার)
    "550": "বাংলা", "590": "উচ্চতর গণিত", "630": "রসায়ন", "670": "পদার্থবিজ্ঞান", "710": "জীববিজ্ঞান", "750": "নাই", "790": "ইংরেজি"
  },
  {
    // Tuesday (মঙ্গলবার)
    "550": "রসায়ন", "590": "পদার্থবিজ্ঞান", "630": "উচ্চতর গণিত", "670": "ইংরেজি", "710": "বাংলা", "750": "জীববিজ্ঞান", "790": "ICT" 
  },
  {
    // Wednesday (বুধবার)
    "550": "জীববিজ্ঞান", "590": "পদার্থবিজ্ঞান", "630": "ICT", "670": "রসায়ন", "710": "উচ্চতর গণিত", "750": "ইংরেজি", "790": "বাংলা"
  },
  {
    // Thursday (বৃহস্পতিবার)
    "550": "নাই", "590": "ICT", "630": "রসায়ন", "670": "বাংলা", "710": "উচ্চতর গণিত", "750": "জীববিজ্ঞান", "790": "ইংরেজি"
  },
  {
    // Friday (শুক্রবার - বন্ধ)
    "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই","750": "নাই", "790": "নাই"
  },
  {
    // Saturday (শনিবার - বন্ধ)
    
    // Friday (শুক্রবার - বন্ধ)
    "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই","750": "নাই", "790": "নাই"
  
  }
];
let prevRoutine = [
  
  {
    // Sunday (রবিবার)
    "550": "জীববিজ্ঞান", "590": "পদার্থবিজ্ঞান", "630": "বাংলা", "670": "রসায়ন", "710": "উচ্চতর গণিত", "750": "ইংরেজি", "790": "ICT"
  },
  {
    // Monday (সোমবার)
    "550": "বাংলা", "590": "উচ্চতর গণিত", "630": "রসায়ন", "670": "পদার্থবিজ্ঞান", "710": "জীববিজ্ঞান", "750": "নাই", "790": "ইংরেজি"
  },
  {
    // Tuesday (মঙ্গলবার)
    "550": "রসায়ন", "590": "পদার্থবিজ্ঞান", "630": "উচ্চতর গণিত", "670": "ইংরেজি", "710": "বাংলা", "750": "জীববিজ্ঞান", "790": "ICT" 
  },
  {
    // Wednesday (বুধবার)
    "550": "জীববিজ্ঞান", "590": "পদার্থবিজ্ঞান", "630": "ICT", "670": "রসায়ন", "710": "উচ্চতর গণিত", "750": "ইংরেজি", "790": "বাংলা"
  },
  {
    // Thursday (বৃহস্পতিবার)
    "550": "নাই", "590": "ICT", "630": "রসায়ন", "670": "বাংলা", "710": "উচ্চতর গণিত", "750": "জীববিজ্ঞান", "790": "ইংরেজি"
  },
  {
    // Friday (শুক্রবার - বন্ধ)
    "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই","750": "নাই", "790": "নাই"
  },
  {
    // Saturday (শনিবার - বন্ধ)
    
    // Friday (শুক্রবার - বন্ধ)
    "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই","750": "নাই", "790": "নাই"
  
  }

]